; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 624869 1 2 4 8 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared3 - mode
	spectrograph1 - mode
	image0 - mode
	thermograph2 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(have_image Planet8 infrared3)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon10 spectrograph1)
	(have_image Star11 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 star11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star11)
   goals met: 0 of 4
3. (turn_to satellite0 groundstation6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 4
4. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 4
5. (turn_to satellite0 star11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star11)
   goals met: 0 of 4
6. (take_image satellite0 star11 instrument0 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 1 of 4
7. (turn_to satellite0 planet8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet8)
   goals met: 1 of 4
8. (take_image satellite0 planet8 instrument0 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 2 of 4
9. (turn_to satellite0 phenomenon9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 4
10. (take_image satellite0 phenomenon9 instrument0 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 3 of 4
11. (turn_to satellite0 phenomenon10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 4
12. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 4 of 4
